#!/usr/bin/env bash
# скрипт для конвертации старого синтаксиса ЛЯПАСа в новый
# использовать так:
# cat prog.l | ./.l_sin.sh | newprog.l
# может работать некорректно в некоторых ситуациях, надо доработать
sed -r -e 's/\s*([-+/*;<>=#])/\1/g' |
sed -r -e 's/([-+/*;<>=#])\s*/\1/g' |
sed -r -e 's/P([0-9]+)/§\1/g;s/D/∆/g;s/Y/∇/g' |
sed -r -e 's/_/⁻/g;s/\?=/→/g;s/\?\+/↦/g;s/\?-/↪/g' |
sed -r -e 's/\?\(([-+*/;<>=#a-zA-Z0-9 ]*)\)/↑(\1)/g;s/=/⇒/g' |
sed -r -e 's/(\([-+*/;<>a-zA-Z0-9 ]*)⇒([-+*/;<>=#a-zA-Z0-9 ]*\))/\1=\2/g' |
sed -r -e 's/(\([-+*/;<>a-zA-Z0-9 ]*)#([-+*/;<>=#a-zA-Z0-9 ]*\))/\1≠\2/g' |
sed -r -e 's/<=/≤/g;s/>=/≥/g;s/#/⊕/g;s/\|/∨/g' |
sed -r -e 's/([0-9a-zA-Z]*)⁻([_⁻0-9a-zA-Z]*)\(([0-9a-zLFK,]*)\/([0-9a-zLFK,]*)\)/\1_\2(\3\/\4)/g' |
sed -r -e 's/([0-9a-zA-Z]*)⁻([_⁻0-9a-zA-Z]*)\(([0-9a-zLFK,]*)\/([0-9a-zLFK,]*)\)/\1_\2(\3\/\4)/g' |
sed -r -e 's/\{(.*)⁻(.*)\}/{\1_\2}/g;s/\[(.*)⁻(.*)\]/[\1_\2]/g' |
sed -r -e 's/([0-9a-zA-Z]*)§([_⁻0-9a-zA-Z]*)\(([0-9a-zLFK,]*)\/([0-9a-zLFK,]*)\)/\1P\2(\3\/\4)/g' |
sed -r -e 's/([0-9a-zA-Z]*)$([_⁻0-9a-zA-Z]*)\(([0-9a-zLFK,]*)\/([0-9a-zLFK,]*)\)/\1P\2(\3\/\4)/g' |
sed -r -e 's/\{(.*)§(.*)\}/{\1P\2}/g;s/\[(.*)§(.*)\]/[\1P\2]/g' |
sed -r -e 's/('\''[^∆]*)∆/\1D/g;s/('\''[^∇]*)∇/\1Y/g'
